import 'package:flutter/material.dart';
import 'package:get/get.dart';

import '../more_text.dart';

class TextContent extends GetView {
  const TextContent({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return const MoreText(
      text: "元而群员采口何很题也，住此本百量主起研看列，示有T在吵飞他否。 西住那就有易都没须通，信除北好者第较， 很本而那些权类人军，越",
      maxLines: 2,
    );
  }
}

//   Text(
//         "元而群员采口何很题也，住此本百量主起研看列，示有T在吵飞他否。 西住那就有易都没须通，信除北好者第较，数表刷但议枣秤问。 电高况气步运难美难然美者能，说离日样路I二受提村。 只之展层加种教，果信价名府日，元8一写包。 九高科民引第么将而，转圆选值得外行用出，厂2想Z劳克秤。 教通第打九它二，压委决回多易件市，用5刺柜入他。 备火张流局身亲再太受且使，花面亲什七林构或不己感，别办9凝茅村孤劳业报。 实际飞油体很示多内政量并多几回反那，圆究价教满我更起9束西确被改R。 即并须我备类几况文品区，世严省计听路族六半，少众B枣白什别V询。 是义品来被为，般过团时强，根N男虚。 三老么织展但性引，现据细区他适提况，可李财R火得。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。 很本而那些权类人军，越象程连据应合通，关总T增叫习两油。",
//         overflow: TextOverflow.clip,
//         maxLines: 10,
//       ),
// }
